apache/nuttx/arch/arm/src/stm32l4/stm32l4_lptim.c
static const struct stm32_lptim_ops_s stm32_lptim_ops =
{
  .setmode        = &stm32_lptim_setmode,
  .setclock       = &stm32_lptim_setclock,
  .setchannel     = &stm32_lptim_setchannel,
  .setclocksource = &stm32_lptim_setclocksource,
  .setpolarity    = &stm32_lptim_setpolarity,
  .getcounter     = &stm32_lptim_getcounter,
  .setcountmode   = &stm32_lptim_setcountmode,
  .setperiod      = &stm32_lptim_setperiod,
  .getperiod      = &stm32_lptim_getperiod
};

#if defined(CONFIG_STM32_LPTIM1)
static struct stm32_lptim_priv_s stm32_lptim1_priv =
{
  .ops        = &stm32_lptim_ops,
  .mode       = STM32_LPTIM_MODE_UNUSED,
  .base       = STM32_LPTIM1_BASE,
  .freq       = STM32_LPTIM1_FREQUENCY,  /* Must be defined in board.h */
};
#endif

#if defined(CONFIG_STM32_LPTIM2)
static struct stm32_lptim_priv_s stm32_lptim2_priv =
{
  .ops        = &stm32_lptim_ops,
  .mode       = STM32_LPTIM_MODE_UNUSED,
  .base       = STM32_LPTIM2_BASE,
  .freq       = STM32_LPTIM2_FREQUENCY,  /* Must be defined in board.h */
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_lptim_getstruct
 ****************************************************************************/

static struct stm32_lptim_dev_s *stm32_lptim_getstruct(int timer)
{
  switch (timer)
    {
#if defined(CONFIG_STM32_LPTIM1)
      case 1:
        return (struct stm32_lptim_dev_s *)&stm32_lptim1_priv;
#endif
#if defined(CONFIG_STM32_LPTIM2)
      case 2:
        return (struct stm32_lptim_dev_s *)&stm32_lptim2_priv;
#endif
      default:
        return NULL;
    }
}

/****************************************************************************
 * Name: stm32_modifyreg32
 ****************************************************************************/

static inline void stm32_modifyreg32(struct stm32_lptim_dev_s *dev,
                                       uint8_t offset, uint32_t clearbits,
                                       uint32_t setbits)
{
  modifyreg32(((struct stm32_lptim_priv_s *)dev)->base + offset,
              clearbits, setbits);
}

/****************************************************************************
 * Name: stm32_lptim_enable
 ****************************************************************************/

static int stm32_lptim_enable(struct stm32_lptim_dev_s *dev)
{
  DEBUGASSERT(dev != NULL);

  switch (((struct stm32_lptim_priv_s *)dev)->base)
    {
#if defined(CONFIG_STM32_LPTIM1)
      case STM32_LPTIM1_BASE:
        modifyreg32(STM32_RCC_APB1ENR1, 0, RCC_APB1ENR1_LPTIM1EN);
        break;
#endif
#if defined(CONFIG_STM32_LPTIM2)
      case STM32_LPTIM2_BASE:
        modifyreg32(STM32_RCC_APB1ENR2, 0, RCC_APB1ENR2_LPTIM2EN);
        break;
#endif

      default:
        return ERROR;
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_lptim_disable
 ****************************************************************************/

static int stm32_lptim_disable(struct stm32_lptim_dev_s *dev)
{
  DEBUGASSERT(dev != NULL);

  switch (((struct stm32_lptim_priv_s *)dev)->base)
    {
#if defined(CONFIG_STM32_LPTIM1)
      case STM32_LPTIM1_BASE:
        modifyreg32(STM32_RCC_APB1ENR1, RCC_APB1ENR1_LPTIM1EN, 0);
        break;
#endif
#if defined(CONFIG_STM32_LPTIM2)
      case STM32_LPTIM2_BASE:
        modifyreg32(STM32_RCC_APB1ENR2, RCC_APB1ENR2_LPTIM2EN, 0);
        break;
#endif

      default:
        return ERROR;
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_lptim_reset
 ****************************************************************************/

static int stm32_lptim_reset(struct stm32_lptim_dev_s *dev)
{
  DEBUGASSERT(dev != NULL);

  switch (((struct stm32_lptim_priv_s *)dev)->base)
    {
#if defined(CONFIG_STM32_LPTIM1)
      case STM32_LPTIM1_BASE:
        modifyreg32(STM32_RCC_APB1RSTR1, 0, RCC_APB1RSTR1_LPTIM1RST);
        modifyreg32(STM32_RCC_APB1RSTR1, RCC_APB1RSTR1_LPTIM1RST, 0);
        break;
#endif
#if defined(CONFIG_STM32_LPTIM2)
      case STM32_LPTIM2_BASE:
        modifyreg32(STM32_RCC_APB1RSTR2, 0, RCC_APB1RSTR2_LPTIM2RST);
        modifyreg32(STM32_RCC_APB1RSTR2, RCC_APB1RSTR2_LPTIM2RST, 0);
        break;
#endif
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_lptim_get_gpioconfig
 ****************************************************************************/

static int stm32_lptim_get_gpioconfig(struct stm32_lptim_dev_s *dev,
                                        stm32_lptim_channel_t channel,
                                        uint32_t *cfg)
{
  DEBUGASSERT(dev != NULL && cfg != NULL);

  channel &= STM32_LPTIM_CH_MASK;

  switch (((struct stm32_lptim_priv_s *)dev)->base)
    {
#if defined(CONFIG_STM32_LPTIM1)
      case STM32_LPTIM1_BASE:
        switch (channel)
          {
#  if defined(GPIO_LPTIM1_OUT_1)
            case 1:
              *cfg = GPIO_LPTIM1_OUT_1;
              break;
#  endif
#  if defined(GPIO_LPTIM1_OUT_2)
            case 2:
              *cfg = GPIO_LPTIM1_OUT_2;
              break;
#  endif
#  if defined(GPIO_LPTIM1_OUT_3)
            case 3:
              *cfg = GPIO_LPTIM1_OUT_3;
              break;
#  endif
            default:
              return ERROR;
          }
        break;
#endif /* CONFIG_STM32_LPTIM1 */

#if defined(CONFIG_STM32_LPTIM2)
      case STM32_LPTIM2_BASE:
        switch (channel)
          {
#  if defined(GPIO_LPTIM2_OUT_1)
            case 1:
              *cfg = GPIO_LPTIM2_OUT_1;
              break;
#  endif
#  if defined(GPIO_LPTIM2_OUT_2)
            case 2:
              *cfg = GPIO_LPTIM2_OUT_2;
              break;
#  endif
#  if defined(GPIO_LPTIM2_OUT_3)
            case 3:
              *cfg = GPIO_LPTIM2_OUT_3;
              break;
#  endif
            default:
              return ERROR;
          }
        break;
#endif /* CONFIG_STM32_LPTIM2 */

      default:
        return ERROR;
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_lptim_setmode
 ****************************************************************************/

