apache/nuttx/arch/arm/src/stm32l4/stm32l4_lptim.c
static int stm32_lptim_setmode(struct stm32_lptim_dev_s *dev,
                                 stm32_lptim_mode_t mode)
{
  const uint32_t addr = ((struct stm32_lptim_priv_s *)dev)->base +
                        STM32_LPTIM_CR_OFFSET;

  DEBUGASSERT(dev != NULL);

  /* Mode */

  switch (mode & STM32_LPTIM_MODE_MASK)
    {
      case STM32_LPTIM_MODE_DISABLED:
          modifyreg32(addr, LPTIM_CR_ENABLE, 0);
          break;

      case STM32_LPTIM_MODE_SINGLE:
          modifyreg32(addr, 0, LPTIM_CR_ENABLE);
          modifyreg32(addr, 0, LPTIM_CR_SNGSTRT);
          break;

      case STM32_LPTIM_MODE_CONTINUOUS:
          modifyreg32(addr, 0, LPTIM_CR_ENABLE);
          modifyreg32(addr, 0, LPTIM_CR_CNTSTRT);
          break;

      default:
          return ERROR;
    }

  /* Save mode */

  ((struct stm32_lptim_priv_s *)dev)->mode = mode;

  return OK;
}

/****************************************************************************
 * Name: stm32_lptim_setclock
 ****************************************************************************/

static int stm32_lptim_setclock(struct stm32_lptim_dev_s *dev,
                                  uint32_t freq)
{
  struct stm32_lptim_priv_s *priv =
                                (struct stm32_lptim_priv_s *)dev;
  uint32_t setbits;
  uint32_t actual;

  DEBUGASSERT(dev != NULL);

  /* Disable Timer? */

  if (freq == 0)
    {
      stm32_lptim_disable(dev);
      return 0;
    }

  if (freq >= priv->freq >> 0)
    {
      /* More than clock source.  This is as fast as we can go */

      setbits = LPTIM_CFGR_PRESCd1;
      actual = priv->freq >> 0;
    }
  else if (freq >= priv->freq >> 1)
    {
      setbits = LPTIM_CFGR_PRESCd2;
      actual = priv->freq >> 1;
    }
  else if (freq >= priv->freq >> 2)
    {
      setbits = LPTIM_CFGR_PRESCd4;
      actual = priv->freq >> 2;
    }
  else if (freq >= priv->freq >> 3)
    {
      setbits = LPTIM_CFGR_PRESCd8;
      actual = priv->freq >> 3;
    }
  else if (freq >= priv->freq >> 4)
    {
      setbits = LPTIM_CFGR_PRESCd16;
      actual = priv->freq >> 4;
    }
  else if (freq >= priv->freq >> 5)
    {
      setbits = LPTIM_CFGR_PRESCd32;
      actual = priv->freq >> 5;
    }
  else if (freq >= priv->freq >> 6)
    {
      setbits = LPTIM_CFGR_PRESCd64;
      actual = priv->freq >> 6;
    }
  else
    {
      /* This is as slow as we can go */

      setbits = LPTIM_CFGR_PRESCd128;
      actual = priv->freq >> 7;
    }

  stm32_modifyreg32(dev, STM32_LPTIM_CFGR_OFFSET, LPTIM_CFGR_PRESC_MASK,
                    setbits);
  stm32_lptim_enable(dev);

  return actual;
}

/****************************************************************************
 * Name: stm32_lptim_setchannel
 ****************************************************************************/

static int stm32_lptim_setchannel(struct stm32_lptim_dev_s *dev,
                                    stm32_lptim_channel_t channel,
                                    int enable)
{
  int ret = OK;
  uint32_t cfg = 0;

  DEBUGASSERT(dev);

  /* Configure GPIOs */

  ret = stm32_lptim_get_gpioconfig(dev, channel, &cfg);
  if (!ret)
    {
      if (enable)
        {
          stm32_configgpio(cfg);
        }
      else
        {
          stm32_unconfiggpio(cfg);
        }
    }

  return ret;
}

/****************************************************************************
 * Name: stm32_lptim_setclocksource
 ****************************************************************************/

static int stm32_lptim_setclocksource(struct stm32_lptim_dev_s *dev,
                                        stm32_lptim_clksrc_t clksrc)
{
  struct stm32_lptim_priv_s *priv =
                                 (struct stm32_lptim_priv_s *)dev;

  DEBUGASSERT(dev != NULL);

  if (clksrc == STM32_LPTIM_CLK_EXT)
    {
      stm32_modifyreg32(dev, STM32_LPTIM_CFGR_OFFSET,
                          LPTIM_CFGR_CKSEL_MASK,
                          LPTIM_CFGR_CKSEL_EXTCLK);
    }
  else
    {
      uint32_t ccr_mask = 0;

      switch (priv->base)
        {
#ifdef CONFIG_STM32_LPTIM1
          case STM32_LPTIM1_BASE:
            ccr_mask = RCC_CCIPR_LPTIM1SEL_MASK;
          break;
#endif
#ifdef CONFIG_STM32_LPTIM2
          case STM32_LPTIM2_BASE:
            ccr_mask = RCC_CCIPR_LPTIM2SEL_MASK;
          break;
#endif
        }

      uint32_t ccr_bits = 0;

      switch (clksrc)
        {
          case STM32_LPTIM_CLK_PCLK:
            switch (priv->base)
              {
#ifdef CONFIG_STM32_LPTIM1
                case STM32_LPTIM1_BASE:
                  ccr_bits = RCC_CCIPR_LPTIM1SEL_PCLK;
                break;
#endif
#ifdef CONFIG_STM32_LPTIM2
              case STM32_LPTIM2_BASE:
                  ccr_bits = RCC_CCIPR_LPTIM2SEL_PCLK;
                break;
#endif
              }
          break;
          case STM32_LPTIM_CLK_HSI:
          switch (priv->base)
            {
#ifdef CONFIG_STM32_LPTIM1
              case STM32_LPTIM1_BASE:
                ccr_bits = RCC_CCIPR_LPTIM1SEL_HSI;
              break;
#endif
#ifdef CONFIG_STM32_LPTIM2
            case STM32_LPTIM2_BASE:
                ccr_bits = RCC_CCIPR_LPTIM2SEL_HSI;
              break;
#endif
            }
          break;
          case STM32_LPTIM_CLK_LSI:
          switch (priv->base)
            {
#ifdef CONFIG_STM32_LPTIM1
              case STM32_LPTIM1_BASE:
                ccr_bits = RCC_CCIPR_LPTIM1SEL_LSI;
              break;
#endif
#ifdef CONFIG_STM32_LPTIM2
            case STM32_LPTIM2_BASE:
                ccr_bits = RCC_CCIPR_LPTIM2SEL_LSI;
              break;
#endif
            }
          break;
          case STM32_LPTIM_CLK_LSE:
          switch (priv->base)
            {
#ifdef CONFIG_STM32_LPTIM1
              case STM32_LPTIM1_BASE:
                ccr_bits = RCC_CCIPR_LPTIM1SEL_LSE;
              break;
#endif
#ifdef CONFIG_STM32_LPTIM2
            case STM32_LPTIM2_BASE:
                ccr_bits = RCC_CCIPR_LPTIM2SEL_LSE;
              break;
#endif
            }
          break;
          default:
          break;
        }

      modifyreg32(STM32_RCC_CCIPR, ccr_mask, ccr_bits);

      stm32_modifyreg32(dev, STM32_LPTIM_CFGR_OFFSET,
                          LPTIM_CFGR_CKSEL_MASK,
                          LPTIM_CFGR_CKSEL_INTCLK);
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_lptim_setperiod
 ****************************************************************************/

static void stm32_lptim_setperiod(struct stm32_lptim_dev_s *dev,
                                    uint32_t period)
{
  struct stm32_lptim_priv_s *priv =
                                (struct stm32_lptim_priv_s *)dev;

  DEBUGASSERT(dev != NULL);
  putreg32(period, (uintptr_t)(priv->base + STM32_LPTIM_ARR_OFFSET));
}

/****************************************************************************
 * Name: stm32_tim_getperiod
 ****************************************************************************/

