apache/nuttx/arch/arm/src/stm32l4/stm32l4_lptim.c
static uint32_t stm32_lptim_getperiod(struct stm32_lptim_dev_s *dev)
{
  struct stm32_lptim_priv_s *priv =
                                  (struct stm32_lptim_priv_s *)dev;

  DEBUGASSERT(dev != NULL);
  return getreg32((uintptr_t)(priv->base + STM32_LPTIM_ARR_OFFSET));
}

/****************************************************************************
 * Name: stm32_lptim_setcountmode
 ****************************************************************************/

static int stm32_lptim_setcountmode(struct stm32_lptim_dev_s *dev,
                                      stm32_lptim_cntmode_t cntmode)
{
  DEBUGASSERT(dev != NULL);

  if (cntmode == STM32_LPTIM_COUNT_CLOCK)
    {
      stm32_modifyreg32(dev, STM32_LPTIM_CFGR_OFFSET,
                          LPTIM_CFGR_COUNTMODE, 0);
    }
  else if (cntmode == STM32_LPTIM_COUNT_EXTTRIG)
    {
      stm32_modifyreg32(dev, STM32_LPTIM_CFGR_OFFSET,
                          0, LPTIM_CFGR_COUNTMODE);
    }
  else
    {
      return ERROR;
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_lptim_setpolarity
 ****************************************************************************/

static int stm32_lptim_setpolarity(struct stm32_lptim_dev_s *dev,
                                     stm32_lptim_clkpol_t polarity)
{
  DEBUGASSERT(dev != NULL);

  switch (polarity)
    {
      case STM32_LPTIM_CLKPOL_RISING:
          stm32_modifyreg32(dev, STM32_LPTIM_CFGR_OFFSET,
                              LPTIM_CFGR_CKPOL_MASK,
                              LPTIM_CFGR_CKPOL_RISING);
          break;

      case STM32_LPTIM_CLKPOL_FALLING:
          stm32_modifyreg32(dev, STM32_LPTIM_CFGR_OFFSET,
                              LPTIM_CFGR_CKPOL_MASK,
                              LPTIM_CFGR_CKPOL_FALLING);
          break;

      case STM32_LPTIM_CLKPOL_BOTH:
          stm32_modifyreg32(dev, STM32_LPTIM_CFGR_OFFSET,
                              LPTIM_CFGR_CKPOL_MASK,
                              LPTIM_CFGR_CKPOL_BOTH);
          break;
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_lptim_setpolarity
 ****************************************************************************/

static uint32_t stm32_lptim_getcounter(struct stm32_lptim_dev_s *dev)
{
  struct stm32_lptim_priv_s *priv =
                                 (struct stm32_lptim_priv_s *)dev;

  DEBUGASSERT(dev != NULL);

  uint32_t counter1;
  uint32_t counter2;

  do
    {
      counter1 = getreg32((uintptr_t)(priv->base +
                                      STM32_LPTIM_CNT_OFFSET));
      counter2 = getreg32((uintptr_t)(priv->base +
                                      STM32_LPTIM_CNT_OFFSET));
    }
  while (counter1 != counter2);

  return counter1;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_lptim_init
 ****************************************************************************/

struct stm32_lptim_dev_s *stm32_lptim_init(int timer)
{
  struct stm32_lptim_dev_s *dev = NULL;

  /* Get structure and enable power */

  dev = stm32_lptim_getstruct(timer);
  if (!dev)
    {
      return NULL;
    }

  /* Is device already allocated */

  if (((struct stm32_lptim_priv_s *)dev)->mode !=
        STM32_LPTIM_MODE_UNUSED)
    {
      return NULL;
    }

  /* Enable power */

  stm32_lptim_enable(dev);

  /* Reset timer */

  stm32_lptim_reset(dev);

  /* Mark it as used */

  ((struct stm32_lptim_priv_s *)dev)->mode = STM32_LPTIM_MODE_DISABLED;

  return dev;
}

/****************************************************************************
 * Name: stm32_lptim_deinit
 ****************************************************************************/

int stm32_lptim_deinit(struct stm32_lptim_dev_s * dev)
{
  DEBUGASSERT(dev);

  /* Disable power */

  stm32_lptim_disable(dev);

  /* Mark it as free */

  ((struct stm32_lptim_priv_s *)dev)->mode = STM32_LPTIM_MODE_UNUSED;

  return OK;
}

#endif /* CONFIG_STM32_LPTIM1 || CONFIG_STM32_LPTIM2 */
